app/controllers/todos_controller.rb

INSERT INTO "todos" ("user", "content", "decision", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user", "Wan"], ["content", "coding+++++++++"], ["decision", "allwo"], ["done", "no"], ["created_at", "2015-11-29 03:35:02.580609"], ["updated_at", "2015-11-29 03:35:02.580609"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save